In [1]:
import numpy as np
import pandas as pd

In [9]:
obj = pd.Series(np.arange(3), index = ["a", "b", "c"])
obj

a    0
b    1
c    2
dtype: int64

In [15]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=["Ohio", "Colorado", "Utah", "New York"],
columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [28]:
data.loc["Colorado", ["two", "three"]] #loc selects value using label
#here we are selecting row colorado with colum value two and three

two      5
three    6
Name: Colorado, dtype: int64

In [29]:
data.iloc[[1,3]]

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [30]:
data.iloc[[1,3],[0,2]]
#iloc works on integer. Here we select row second and fourth and column one and three

          one  three
Colorado    4      6
New York   12     14

In [31]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [35]:
data.loc["Utah", "two"] 
#it selects row Utah and column two and hence value will be 9

np.int64(9)

In [36]:
data.loc[:"Utah", "two"] 
#select rows before Utah and inclusing Utah and the colum two. Hence value will be
#1,5,9

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int64

In [37]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [38]:
data.iloc[:3] #here unlike above, it will not include row 3

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [42]:
data.iloc[:,:3] #this will make change in column. Select upto column 2 and not 3

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [43]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [51]:
data.iloc[:,:3][data>5]
#it will mark NaN for values which are not greater than 5

           one   two  three
Ohio       NaN   NaN    NaN
Colorado   NaN   NaN    6.0
Utah       8.0   9.0   10.0
New York  12.0  13.0   14.0

In [54]:
data.iloc[:,:3][data.one>5]
#becaue ohio has all values less than 5, it will not show. even if one value is less
#5, it willl remove all as in case of colorado

          one  two  three
Utah        8    9     10
New York   12   13     14